## DATA FRAME

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(101)

In [6]:
#creating data frame

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
#print colunms

df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [14]:
# print list of columns

df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [34]:
#Adding new columns

df['New'] = df['W'] + df ['Y']

In [43]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [ ]:
 removing column, inplace argument to stay inplace column is permanmently remove

df.drop('W',axis=1,inplace=True)

In [45]:
#Drop row

df.drop('E')

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057

In [46]:
df.shape

(5, 3)

In [47]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [48]:
#Selecting Columns

df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [49]:
#Selecting rows

df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [52]:
# Using LOC function ( Rows)

df.loc['A']

X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [53]:
#index location using ILOC function

#Selecting row Location [LOC] and integer base locatiuon iloc[]

df.iloc[2]

X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [54]:
# Selecting subsets rows and columns ( rows and column you want)


df.loc['B','Y']

-0.8480769834036315

In [55]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [56]:
# select columns and row wanted

df.loc[['A','B'],['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

## DATA FRAME PART 2

In [57]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

## Conditional selection

In [58]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [59]:
#Conditional selection

df>0

       X      Y      Z
A   True   True   True
B  False  False   True
C   True   True  False
D  False  False   True
E   True   True   True

In [61]:
booldf =df > 0

In [62]:
booldf

       X      Y      Z
A   True   True   True
B  False  False   True
C   True   True  False
D  False  False   True
E   True   True   True

In [63]:
df[booldf]

          X         Y         Z
A  0.628133  0.907969  0.503826
B       NaN       NaN  0.605965
C  0.740122  0.528813       NaN
D       NaN       NaN  0.955057
E  1.978757  2.605967  0.683509

In [64]:
#all in one step

df[df>0]

          X         Y         Z
A  0.628133  0.907969  0.503826
B       NaN       NaN  0.605965
C  0.740122  0.528813       NaN
D       NaN       NaN  0.955057
E  1.978757  2.605967  0.683509

In [65]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [66]:
df["X"]>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [67]:
#Column < than 0


df[df['Z']>0]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [69]:
# result

resultdf = df[df['X']>0]

In [70]:
resultdf['X']

A    0.628133
C    0.740122
E    1.978757
Name: X, dtype: float64

In [71]:
# One step method

df[df['X']>0]['Y']

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [73]:
df[df['X']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [74]:
#Break down ## all this can be written as """"""df[df['X']>0][['Y','Z']]""""""

boolser = df['X']>0
result = df[boolser]
mycols = ['X','Y']
result[mycols]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967

In [76]:
df[df['X']>0 & (df['Y']>1)]

          X         Y         Z
A  0.628133  0.907969  0.503826
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509

In [80]:
# or operation

df[(df['X']>0) | (df['Y']>1)]

          X         Y         Z
A  0.628133  0.907969  0.503826
C  0.740122  0.528813 -0.589001
E  1.978757  2.605967  0.683509

## Index reset

In [81]:
# reset index

df.reset_index()

  index         X         Y         Z
0     A  0.628133  0.907969  0.503826
1     B -0.319318 -0.848077  0.605965
2     C  0.740122  0.528813 -0.589001
3     D -0.758872 -0.933237  0.955057
4     E  1.978757  2.605967  0.683509

In [82]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [83]:
# Creating new index
newind = 'CA NY WY OR CO'.split()

In [84]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [85]:
df['States'] = newind

In [86]:
df

          X         Y         Z States
A  0.628133  0.907969  0.503826     CA
B -0.319318 -0.848077  0.605965     NY
C  0.740122  0.528813 -0.589001     WY
D -0.758872 -0.933237  0.955057     OR
E  1.978757  2.605967  0.683509     CO

In [87]:
df.set_index('States')

               X         Y         Z
States
CA      0.628133  0.907969  0.503826
NY     -0.319318 -0.848077  0.605965
WY      0.740122  0.528813 -0.589001
OR     -0.758872 -0.933237  0.955057
CO      1.978757  2.605967  0.683509

## DATA FRAME PART 3

In [90]:


# Index levels
outside = ['G1','G1','G1','G2','G2','G2']

inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [91]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [92]:
inside

[1, 2, 3, 1, 2, 3]

In [93]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [94]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [96]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [97]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [98]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [101]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [102]:
#naming index

df.index.names =['Group','Num']

In [103]:
df

                  A         B
Group Num
G1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
G2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [105]:
#Look up number in dataframe

df.loc['G2'].loc[2]['B']

0.19679950499134005

In [106]:
df.xs

<bound method NDFrame.xs of                   A         B
Group Num
G1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
G2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366>

In [107]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755